PratikGupta114/WPSwitch_Receiver_Submersible/ControlUnit/sdkconfig.defaults
#
# Automatically generated file. DO NOT EDIT.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Configuration
#
# default:
CONFIG_SOC_CAPS_ECO_VER_MAX=301
# default:
CONFIG_SOC_ADC_SUPPORTED=y
# default:
CONFIG_SOC_DAC_SUPPORTED=y
# default:
CONFIG_SOC_UART_SUPPORTED=y
# default:
CONFIG_SOC_MCPWM_SUPPORTED=y
# default:
CONFIG_SOC_GPTIMER_SUPPORTED=y
# default:
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y
# default:
CONFIG_SOC_BT_SUPPORTED=y
# default:
CONFIG_SOC_PCNT_SUPPORTED=y
# default:
CONFIG_SOC_PHY_SUPPORTED=y
# default:
CONFIG_SOC_WIFI_SUPPORTED=y
# default:
CONFIG_SOC_SDIO_SLAVE_SUPPORTED=y
# default:
CONFIG_SOC_TWAI_SUPPORTED=y
# default:
CONFIG_SOC_EFUSE_SUPPORTED=y
# default:
CONFIG_SOC_EMAC_SUPPORTED=y
# default:
CONFIG_SOC_ULP_SUPPORTED=y
# default:
CONFIG_SOC_CCOMP_TIMER_SUPPORTED=y
# default:
CONFIG_SOC_RTC_FAST_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_SLOW_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_TIMER_V1_SUPPORTED=y
# default:
CONFIG_SOC_I2S_SUPPORTED=y
# default:
CONFIG_SOC_I2S_I80_LCD_SUPPORTED=y
# default:
CONFIG_SOC_LCD_I80_SUPPORTED=y
# default:
CONFIG_SOC_RMT_SUPPORTED=y
# default:
CONFIG_SOC_SDM_SUPPORTED=y
# default:
CONFIG_SOC_GPSPI_SUPPORTED=y
# default:
CONFIG_SOC_LEDC_SUPPORTED=y
# default:
CONFIG_SOC_I2C_SUPPORTED=y
# default:
CONFIG_SOC_SUPPORT_COEXISTENCE=y
# default:
CONFIG_SOC_AES_SUPPORTED=y
# default:
CONFIG_SOC_MPI_SUPPORTED=y
# default:
CONFIG_SOC_SHA_SUPPORTED=y
# default:
CONFIG_SOC_FLASH_ENC_SUPPORTED=y
# default:
CONFIG_SOC_SECURE_BOOT_SUPPORTED=y
# default:
CONFIG_SOC_TOUCH_SENSOR_SUPPORTED=y
# default:
CONFIG_SOC_BOD_SUPPORTED=y
# default:
CONFIG_SOC_ULP_FSM_SUPPORTED=y
# default:
CONFIG_SOC_CLK_TREE_SUPPORTED=y
# default:
CONFIG_SOC_MPU_SUPPORTED=y
# default:
CONFIG_SOC_WDT_SUPPORTED=y
# default:
CONFIG_SOC_SPI_FLASH_SUPPORTED=y
# default:
CONFIG_SOC_RNG_SUPPORTED=y
# default:
CONFIG_SOC_LIGHT_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_DEEP_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_LP_PERIPH_SHARE_INTERRUPT=y
# default:
CONFIG_SOC_PM_SUPPORTED=y
# default:
CONFIG_SOC_DPORT_WORKAROUND_DIS_INTERRUPT_LVL=5
# default:
CONFIG_SOC_XTAL_SUPPORT_26M=y
# default:
CONFIG_SOC_XTAL_SUPPORT_40M=y
# default:
CONFIG_SOC_ADC_RTC_CTRL_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DIG_CTRL_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DMA_SUPPORTED=y
# default:
CONFIG_SOC_ADC_PERIPH_NUM=2
# default:
CONFIG_SOC_ADC_MAX_CHANNEL_NUM=10
# default:
CONFIG_SOC_ADC_ATTEN_NUM=4
# default:
CONFIG_SOC_ADC_DIGI_CONTROLLER_NUM=2
# default:
CONFIG_SOC_ADC_PATT_LEN_MAX=16
# default:
CONFIG_SOC_ADC_DIGI_MIN_BITWIDTH=9
# default:
CONFIG_SOC_ADC_DIGI_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_DIGI_RESULT_BYTES=2
# default:
CONFIG_SOC_ADC_DIGI_DATA_BYTES_PER_CONV=4
# default:
CONFIG_SOC_ADC_DIGI_MONITOR_NUM=0
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_HIGH=2000000
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_LOW=20000
# default:
CONFIG_SOC_ADC_RTC_MIN_BITWIDTH=9
# default:
CONFIG_SOC_ADC_RTC_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_SHARED_POWER=y
# default:
CONFIG_SOC_BROWNOUT_RESET_SUPPORTED=y
# default:
CONFIG_SOC_SHARED_IDCACHE_SUPPORTED=y
# default:
CONFIG_SOC_IDCACHE_PER_CORE=y
# default:
CONFIG_SOC_CPU_CORES_NUM=2
# default:
CONFIG_SOC_CPU_INTR_NUM=32
# default:
CONFIG_SOC_CPU_HAS_FPU=y
# default:
CONFIG_SOC_HP_CPU_HAS_MULTIPLE_CORES=y
# default:
CONFIG_SOC_CPU_BREAKPOINTS_NUM=2
# default:
CONFIG_SOC_CPU_WATCHPOINTS_NUM=2
# default:
CONFIG_SOC_CPU_WATCHPOINT_MAX_REGION_SIZE=0x40
# default:
CONFIG_SOC_DAC_CHAN_NUM=2
# default:
CONFIG_SOC_DAC_RESOLUTION=8
# default:
CONFIG_SOC_DAC_DMA_16BIT_ALIGN=y
# default:
CONFIG_SOC_GPIO_PORT=1
# default:
CONFIG_SOC_GPIO_PIN_COUNT=40
# default:
CONFIG_SOC_GPIO_VALID_GPIO_MASK=0xFFFFFFFFFF
# default:
CONFIG_SOC_GPIO_IN_RANGE_MAX=39
# default:
CONFIG_SOC_GPIO_OUT_RANGE_MAX=33
# default:
CONFIG_SOC_GPIO_VALID_DIGITAL_IO_PAD_MASK=0xEF0FEA
# default:
CONFIG_SOC_GPIO_CLOCKOUT_BY_IO_MUX=y
# default:
CONFIG_SOC_GPIO_CLOCKOUT_CHANNEL_NUM=3
# default:
CONFIG_SOC_I2C_NUM=2
# default:
CONFIG_SOC_HP_I2C_NUM=2
# default:
CONFIG_SOC_I2C_SUPPORT_APB=y
# default:
CONFIG_SOC_I2C_SUPPORT_10BIT_ADDR=y
# default:
CONFIG_SOC_I2C_SUPPORT_SLAVE=y
# default:
CONFIG_SOC_I2C_STOP_INDEPENDENT=y
# default:
CONFIG_SOC_I2S_HW_VERSION_1=y
# default:
CONFIG_SOC_I2S_SUPPORTS_APLL=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_TX=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PCM2PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_RX=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM2PCM=y
# default:
CONFIG_SOC_I2S_PDM_MAX_TX_LINES=1
# default:
CONFIG_SOC_I2S_PDM_MAX_RX_LINES=1
# default:
CONFIG_SOC_LEDC_HAS_TIMER_SPECIFIC_MUX=y
# default:
CONFIG_SOC_LEDC_SUPPORT_APB_CLOCK=y
# default:
CONFIG_SOC_LEDC_SUPPORT_REF_TICK=y
# default:
CONFIG_SOC_LEDC_SUPPORT_HS_MODE=y
# default:
CONFIG_SOC_LEDC_TIMER_NUM=4
# default:
CONFIG_SOC_LEDC_CHANNEL_NUM=8
# default:
CONFIG_SOC_LEDC_TIMER_BIT_WIDTH=20
# default:
CONFIG_SOC_MMU_PERIPH_NUM=2
# default:
CONFIG_SOC_MMU_LINEAR_ADDRESS_REGION_NUM=3
# default:
CONFIG_SOC_MPU_MIN_REGION_SIZE=0x20000000
# default:
CONFIG_SOC_MPU_REGIONS_MAX_NUM=8
# default:
CONFIG_SOC_RMT_MEM_WORDS_PER_CHANNEL=64
# default:
CONFIG_SOC_RTCIO_PIN_COUNT=18
# default:
CONFIG_SOC_RTCIO_INPUT_OUTPUT_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_HOLD_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_WAKE_SUPPORTED=y
# default:
CONFIG_SOC_RTC_CNTL_NEEDS_ATOMIC_ACCESS=y
# default:
CONFIG_SOC_SPI_HD_BOTH_INOUT_SUPPORTED=y
# default:
CONFIG_SOC_SPI_AS_CS_SUPPORTED=y
# default:
CONFIG_SOC_SPI_PERIPH_NUM=3
# default:
CONFIG_SOC_SPI_DMA_CHAN_NUM=2
# default:
CONFIG_SOC_SPI_MAX_CS_NUM=3
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_APB=y
# default:
CONFIG_SOC_SPI_MAXIMUM_BUFFER_SIZE=64
# default:
CONFIG_SOC_SPI_MAX_PRE_DIVIDER=8192
# default:
CONFIG_SOC_MEMSPI_ENCRYPTION_ALIGNMENT=16
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_LO=32
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_HI=16
# default:
CONFIG_SOC_TOUCH_SENSOR_VERSION=1
# default:
CONFIG_SOC_TOUCH_MIN_CHAN_ID=0
# default:
CONFIG_SOC_TOUCH_MAX_CHAN_ID=9
# default:
CONFIG_SOC_TOUCH_SUPPORT_SLEEP_WAKEUP=y
# default:
CONFIG_SOC_TOUCH_SAMPLE_CFG_NUM=1
# default:
CONFIG_SOC_TWAI_CONTROLLER_NUM=1
# default:
CONFIG_SOC_TWAI_MASK_FILTER_NUM=1
# default:
CONFIG_SOC_UART_NUM=3
# default:
CONFIG_SOC_UART_HP_NUM=3
# default:
CONFIG_SOC_UART_SUPPORT_APB_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_REF_TICK=y
# default:
CONFIG_SOC_UART_FIFO_LEN=128
# default:
CONFIG_SOC_UART_BITRATE_MAX=5000000
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_ACTIVE_THRESH_MODE=y
# default:
CONFIG_SOC_SPIRAM_SUPPORTED=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_CONFIG_GPIO_BY_EFUSE=y
# default:
CONFIG_SOC_SHA_SUPPORT_PARALLEL_ENG=y
# default:
CONFIG_SOC_SHA_ENDIANNESS_BE=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA1=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA256=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA384=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512=y
# default:
CONFIG_SOC_MPI_MEM_BLOCKS_NUM=4
# default:
CONFIG_SOC_MPI_OPERATIONS_NUM=1
# default:
CONFIG_SOC_RSA_MAX_BIT_LEN=4096
# default:
CONFIG_SOC_AES_SUPPORT_AES_128=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_192=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_256=y
# default:
CONFIG_SOC_SECURE_BOOT_V1=y
# default:
CONFIG_SOC_EFUSE_SECURE_BOOT_KEY_DIGESTS=1
# default:
CONFIG_SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX=32
# default:
CONFIG_SOC_PHY_DIG_REGS_MEM_SIZE=21
# default:
CONFIG_SOC_PM_SUPPORT_EXT0_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_TOUCH_SENSOR_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_RTC_PERIPH_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RTC_FAST_MEM_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RTC_SLOW_MEM_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC_FAST_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_VDDSDIO_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_MODEM_PD=y
# default:
CONFIG_SOC_CONFIGURABLE_VDDSDIO_SUPPORTED=y
# default:
CONFIG_SOC_PM_MODEM_PD_BY_SW=y
# default:
CONFIG_SOC_CLK_APLL_SUPPORTED=y
# default:
CONFIG_SOC_CLK_RC_FAST_D256_SUPPORTED=y
# default:
CONFIG_SOC_RTC_SLOW_CLK_SUPPORT_RC_FAST_D256=y
# default:
CONFIG_SOC_CLK_RC_FAST_SUPPORT_CALIBRATION=y
# default:
CONFIG_SOC_CLK_XTAL32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_LP_FAST_SUPPORT_XTAL_D4=y
# default:
CONFIG_SOC_SDMMC_USE_IOMUX=y
# default:
CONFIG_SOC_SDMMC_NUM_SLOTS=2
# default:
CONFIG_SOC_SDMMC_DATA_WIDTH_MAX=8
# default:
CONFIG_SOC_WIFI_WAPI_SUPPORT=y
# default:
CONFIG_SOC_WIFI_CSI_SUPPORT=y
# default:
CONFIG_SOC_WIFI_MESH_SUPPORT=y
# default:
CONFIG_SOC_WIFI_SUPPORT_VARIABLE_BEACON_WINDOW=y
# default:
CONFIG_SOC_WIFI_NAN_SUPPORT=y
# default:
CONFIG_SOC_BLE_SUPPORTED=y
# default:
CONFIG_SOC_BLE_MESH_SUPPORTED=y
# default:
CONFIG_SOC_BT_CLASSIC_SUPPORTED=y
# default:
CONFIG_SOC_BLUFI_SUPPORTED=y
# default:
CONFIG_SOC_BT_H2C_ENC_KEY_CTRL_ENH_VSC_SUPPORTED=y
# default:
CONFIG_SOC_BLE_MULTI_CONN_OPTIMIZATION=y
# default:
CONFIG_SOC_ULP_HAS_ADC=y
# default:
CONFIG_SOC_PHY_COMBO_MODULE=y
# default:
CONFIG_SOC_EMAC_RMII_CLK_OUT_INTERNAL_LOOPBACK=y
# default:
CONFIG_IDF_CMAKE=y
# default:
CONFIG_IDF_TOOLCHAIN="gcc"
# default:
CONFIG_IDF_TOOLCHAIN_GCC=y
# default:
CONFIG_IDF_TARGET_ARCH_XTENSA=y
# default:
CONFIG_IDF_TARGET_ARCH="xtensa"
# default:
CONFIG_IDF_TARGET="esp32"
# default:
CONFIG_IDF_INIT_VERSION="6.0.1"
# default:
CONFIG_IDF_TARGET_ESP32=y
# default:
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

#
# Build type
#
CONFIG_APP_BUILD_TYPE_APP_2NDBOOT=y
# CONFIG_APP_BUILD_TYPE_RAM is not set
# default:
CONFIG_APP_BUILD_GENERATE_BINARIES=y
# default:
CONFIG_APP_BUILD_BOOTLOADER=y
# default:
CONFIG_APP_BUILD_USE_FLASH_SECTIONS=y
# CONFIG_APP_REPRODUCIBLE_BUILD is not set
# CONFIG_APP_NO_BLOBS is not set
# CONFIG_APP_COMPATIBLE_PRE_V2_1_BOOTLOADERS is not set
# CONFIG_APP_COMPATIBLE_PRE_V3_1_BOOTLOADERS is not set
# end of Build type

#
# App Update config
#
# end of App Update config

#
# Bootloader config
#

#
# Bootloader manager
#
CONFIG_BOOTLOADER_COMPILE_TIME_DATE=y
CONFIG_BOOTLOADER_PROJECT_VER=1
# end of Bootloader manager

#
# Application Rollback
#
# CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is not set
# end of Application Rollback

#
# Recovery Bootloader and Rollback
#
# end of Recovery Bootloader and Rollback

# default:
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x1000
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF is not set

#
# Log
#
CONFIG_BOOTLOADER_LOG_VERSION_1=y
# default:
CONFIG_BOOTLOADER_LOG_VERSION=1
# CONFIG_BOOTLOADER_LOG_LEVEL_NONE is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_ERROR is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_WARN is not set
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
# CONFIG_BOOTLOADER_LOG_LEVEL_DEBUG is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_VERBOSE is not set
# default:
CONFIG_BOOTLOADER_LOG_LEVEL=3

#
# Format
#
# CONFIG_BOOTLOADER_LOG_COLORS is not set
CONFIG_BOOTLOADER_LOG_TIMESTAMP_SOURCE_CPU_TICKS=y
# end of Format

#
# Settings
#
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT_EN=y
CONFIG_BOOTLOADER_LOG_MODE_TEXT=y
# end of Settings
# end of Log

# default:
CONFIG_BOOTLOADER_CPU_CLK_FREQ_MHZ=80

#
# Serial Flash Configurations
#
# CONFIG_BOOTLOADER_FLASH_DC_AWARE is not set
CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT=y
# end of Serial Flash Configurations

# CONFIG_BOOTLOADER_VDDSDIO_BOOST_1_8V is not set
CONFIG_BOOTLOADER_VDDSDIO_BOOST_1_9V=y
# CONFIG_BOOTLOADER_FACTORY_RESET is not set
# CONFIG_BOOTLOADER_APP_TEST is not set
CONFIG_BOOTLOADER_REGION_PROTECTION_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
# CONFIG_BOOTLOADER_WDT_DISABLE_IN_USER_CODE is not set
CONFIG_BOOTLOADER_WDT_TIME_MS=9000
# CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP is not set
# CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON is not set
# CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS is not set
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0
# CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC is not set
# end of Bootloader config

#
# Security features
#
# default:
CONFIG_SECURE_BOOT_V1_SUPPORTED=y
# CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT is not set
# CONFIG_SECURE_BOOT is not set
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# end of Security features

#
# Application manager
#
CONFIG_APP_COMPILE_TIME_DATE=y
# CONFIG_APP_EXCLUDE_PROJECT_VER_VAR is not set
# CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR is not set
# CONFIG_APP_PROJECT_VER_FROM_CONFIG is not set
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=9
# end of Application manager

# default:
CONFIG_ESP_ROM_HAS_CRC_LE=y
# default:
CONFIG_ESP_ROM_HAS_CRC_BE=y
# default:
CONFIG_ESP_ROM_HAS_MZ_CRC32=y
# default:
CONFIG_ESP_ROM_HAS_JPEG_DECODE=y
# default:
CONFIG_ESP_ROM_HAS_UART_BUF_SWITCH=y
# default:
CONFIG_ESP_ROM_NEEDS_SWSETUP_WORKAROUND=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NANO_FORMAT=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_32BIT_TIME=y
# default:
CONFIG_ESP_ROM_HAS_SW_FLOAT=y
# default:
CONFIG_ESP_ROM_USB_OTG_NUM=-1
# default:
CONFIG_ESP_ROM_USB_SERIAL_DEVICE_NUM=-1
# default:
CONFIG_ESP_ROM_SUPPORT_DEEP_SLEEP_WAKEUP_STUB=y
# default:
CONFIG_ESP_ROM_HAS_OUTPUT_PUTC_FUNC=y

#
# Serial flasher config
#
# CONFIG_ESPTOOLPY_NO_STUB is not set
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# CONFIG_ESPTOOLPY_FLASHFREQ_80M is not set
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
# CONFIG_ESPTOOLPY_FLASHFREQ_26M is not set
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="40m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
CONFIG_ESPTOOLPY_AFTER_RESET=y
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
# CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE is not set
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS is not set
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR is not set
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# Bluetooth
#
# CONFIG_BT_ENABLED is not set

#
# Common Options
#

#
# BLE Log
#
# default:
# CONFIG_BLE_LOG_ENABLED is not set
# end of BLE Log

# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# default:
# CONFIG_BT_BLE_LOG_UHCI_OUT_ENABLED is not set
# default:
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options
# end of Bluetooth

#
# Console Library
#
# CONFIG_CONSOLE_SORTED_HELP is not set
# end of Console Library

#
# Legacy Driver Configurations
#

#
# Legacy TWAI Driver Configurations
#
# default:
# CONFIG_TWAI_ISR_IN_IRAM_LEGACY is not set
# default:
# CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_TWAI_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy TWAI Driver Configurations

#
# Legacy I2C Driver Configurations
#
# default:
# CONFIG_I2C_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy I2C Driver Configurations

#
# Legacy Touch Sensor Driver Configurations
#
# CONFIG_TOUCH_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_TOUCH_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy Touch Sensor Driver Configurations
# end of Legacy Driver Configurations

