PratikGupta114/WPSwitch_Receiver_Submersible/ControlUnit/sdkconfig.defaults
CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
# default:
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# WPSwitch Receiver Configuration
#
CONFIG_BOARD_VARIANT_PROTOTYPE=y
# CONFIG_BOARD_VARIANT_REV1 is not set

#
# GPIO Pin Configuration
#

#
# Relay Control Pins
#
CONFIG_MOTOR_RELAY_SET_PIN=26
CONFIG_MOTOR_RELAY_RESET_PIN=25
CONFIG_MOTOR_RELAY_STATE_INPUT_PIN=13
# end of Relay Control Pins

#
# Button and LED Pins
#
CONFIG_MOTOR_TOGGLE_BUTTON_INPUT_PIN=21
CONFIG_MOTOR_TOGGLE_BUTTON_LED_OUTPUT_PIN=19
CONFIG_NEOPIXEL_DATA_OUTPUT_PIN=23
CONFIG_LED_BUILTIN=2
CONFIG_CONFIG_MODE_BUTTON_INPUT=34
CONFIG_BUZZER_OUTPUT_PIN=33
# end of Button and LED Pins

#
# Display Pins
#
CONFIG_CLOCK_PIN=5
CONFIG_LATCH_PIN=22
CONFIG_DATA_PIN=18
# end of Display Pins

#
# Wireless Communication Pins
#
CONFIG_WIRELESS_DATA_RX_PIN=16
CONFIG_WIRELESS_DATA_TX_PIN=17
CONFIG_WIRELESS_PRG_MODE_PIN=4
# end of Wireless Communication Pins

#
# UART Pins
#
CONFIG_HC_05_TX_PIN=1
CONFIG_HC_05_RX_PIN=3
# end of UART Pins

#
# I2C Pins
#
CONFIG_DS1307_SDA_PIN=32
CONFIG_DS1307_SCL_PIN=27
# end of I2C Pins
# end of GPIO Pin Configuration

#
# UART Configuration
#
CONFIG_UART_PORT_FOR_RECEIVER=2
CONFIG_RECEIVER_PORT_UART_BAUD_RATE=9600
CONFIG_UART_BUFFER_SIZE=1024
CONFIG_UART_DATA_RECEPTION_TIMEOUT_SEC=10
# end of UART Configuration

#
# Sensor Configuration
#
CONFIG_MIN_HUMIDITY_LEVEL=15
CONFIG_MAX_HUMIDITY_LEVEL=85
CONFIG_MIN_TEMPERATURE_LEVEL=0
CONFIG_MAX_TEMPERATURE_LEVEL=55
CONFIG_MIN_WATER_LEVEL=0
CONFIG_MAX_WATER_LEVEL=100
# end of Sensor Configuration

#
# MQTT Configuration
#
CONFIG_MQTT_BROKER_URL="mqtts://k01b8b84.ala.asia-southeast1.emqxsl.com"
CONFIG_MQTT_BROKER_PORT=8883
CONFIG_MQTT_BROKER_URL_DEV="mqtt://192.168.1.107:1883"
CONFIG_MQTT_BROKER_PORT_DEV=1883
CONFIG_MQTT_KEEP_ALIVE_INTERVAL_SECONDS=30
CONFIG_MQTT_RECONNECT_TIMER_PERIOD_MS=10000
CONFIG_MQTT_NETWORK_TIMEOUT_MS=30000
CONFIG_MQTT_MAX_TOPIC_LENGTH=45
CONFIG_MQTT_SESSION_EXPIRY_INTERVAL=10
CONFIG_MQTT_MAXIMUM_PACKET_SIZE=1024
CONFIG_MQTT_MESSAGE_EXPIRY_INTERVAL=10
CONFIG_MQTT_WILL_DELAY_INTERVAL=10
CONFIG_MQTT_INPUT_BUFFER_SIZE=2048
CONFIG_MQTT_OUTPUT_BUFFER_SIZE=2048
CONFIG_MQTT_MESSAGE_RETRANSMISSION_PERIOD=5000
CONFIG_MQTT_TASK_STACK_DEPTH=8192
CONFIG_WPSWITCH_MQTT_TASK_PRIORITY=12
# end of MQTT Configuration

#
# OTA Update Configuration
#
CONFIG_OTA_VERSION_CHECK_URL="https://us-central1-water-level-analyzer.cloudfunctions.net/ota/firmwareData/latest"
CONFIG_OTA_FIRMWARE_DOWNLOAD_URL="https://us-central1-water-level-analyzer.cloudfunctions.net/ota/firmware.bin"
CONFIG_OTA_VERSION_CHECK_URL_DEV="http://192.168.0.171:5001/water-level-analyzer/us-central1/ota/firmwareData/latest"
CONFIG_OTA_FIRMWARE_DOWNLOAD_URL_DEV="http://192.168.0.171:5001/water-level-analyzer/us-central1/ota/firmware.bin"
CONFIG_OTA_UPDATE_CHECK_INTERVAL_HOURS=4
CONFIG_OTA_RECV_TIMEOUT_MS=30000
CONFIG_OTA_HTTP_BUFFER_SIZE=2048
CONFIG_OTA_KEEPALIVE_IDLE_SEC=5
CONFIG_OTA_KEEPALIVE_INTERVAL_SEC=5
CONFIG_OTA_KEEPALIVE_COUNT=3
CONFIG_OTA_WRITE_DATA_BUFFER_LENGTH=1024
CONFIG_OTA_TASK_STACK_DEPTH=8192
CONFIG_OTA_TASK_PRIORITY=8
# end of OTA Update Configuration

#
# Pump Controller Configuration
#
CONFIG_PUMP_MONITORING_TICK_PERIOD_MS=60000
CONFIG_PUMP_STALL_CHECK_INTERVAL_MS=10000
CONFIG_PUMP_DEFAULT_MANUAL_LOCKOUT_DURATION_MS=7200000
CONFIG_PUMP_MIN_WATER_LEVEL_TO_START=15
CONFIG_PUMP_MAX_WATER_LEVEL_TO_STOP=85
CONFIG_PUMP_IMMEDIATE_STALL_CHECK_INTERVAL_MS=15000
CONFIG_PUMP_STALL_GRACE_PERIOD_SEC=60
CONFIG_PUMP_PRIMING_SAFETY_MULTIPLIER=15
CONFIG_PUMP_MAX_PROTECTED_WINDOW_SEC=240
# end of Pump Controller Configuration

#
# WiFi Configuration
#

#
# Access Point Settings
#
CONFIG_WIFI_USE_DYNAMIC_CREDENTIALS=y
CONFIG_WIFI_AP_CHANNEL=1
CONFIG_WIFI_AP_SSID_HIDDEN=0
CONFIG_WIFI_AP_MAX_CONNECTIONS=1
CONFIG_WIFI_AP_BEACON_INTERVAL=300
CONFIG_WIFI_AP_IP="192.168.4.1"
CONFIG_WIFI_AP_GATEWAY="192.168.4.1"
CONFIG_WIFI_AP_NETMASK="255.255.255.0"
# end of Access Point Settings

#
# Station Mode Settings
#
CONFIG_WIFI_MAX_CONNECTION_RETRIES=10
CONFIG_WIFI_AP_CONNECT_RETRY_INTERVAL=30000
CONFIG_MAX_SSID_LENGTH=32
CONFIG_MAX_PASSWORD_LENGTH=64
# end of Station Mode Settings

#
# SNTP Time Synchronization
#
CONFIG_SNTP_TIME_UPDATE_INTERVAL_SEC=300
CONFIG_SNTP_TIME_ZONE="IST-5:30"
CONFIG_SNTP_SERVER_NAME_0="pool.ntp.org"
CONFIG_SNTP_SERVER_NAME_1="in.pool.ntp.org"
CONFIG_SNTP_TIME_SYNC_TASK_STACK_DEPTH=2560
CONFIG_SNTP_TIME_SYNC_TASK_PRIORITY=25
CONFIG_SNTP_TIME_SYNC_INTERVAL=195000
CONFIG_SNTP_TIME_SYNC_RETRY_INTERVAL=3000
CONFIG_SNTP_SYNC_RETRY_COUNT=50
# end of SNTP Time Synchronization

#
# WiFi Task Configuration
#
CONFIG_WIFI_RECONNECTION_TASK_STACK_DEPTH=2560
CONFIG_WIFI_RECONNECTION_TASK_PRIORITY=5
# end of WiFi Task Configuration
# end of WiFi Configuration
# end of WPSwitch Receiver Configuration

#
# cJSON
#
CONFIG_CJSON_NESTING_LIMIT=1000
CONFIG_CJSON_CIRCULAR_LIMIT=10000
# end of cJSON

#
# ESP-MQTT Configurations
#
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y
# CONFIG_MQTT_MSG_ID_INCREMENTAL is not set
# CONFIG_MQTT_SKIP_PUBLISH_IF_DISCONNECTED is not set
# CONFIG_MQTT_REPORT_DELETED_MESSAGES is not set
# CONFIG_MQTT_USE_CUSTOM_CONFIG is not set
# CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED is not set
# CONFIG_MQTT_CUSTOM_OUTBOX is not set
# end of ESP-MQTT Configurations
# end of Component config

# CONFIG_IDF_EXPERIMENTAL_FEATURES is not set

# Deprecated options for backward compatibility
# CONFIG_APP_BUILD_TYPE_ELF_RAM is not set
# CONFIG_NO_BLOBS is not set
# CONFIG_ESP32_NO_BLOBS is not set
# CONFIG_ESP32_COMPATIBLE_PRE_V2_1_BOOTLOADERS is not set
# CONFIG_ESP32_COMPATIBLE_PRE_V3_1_BOOTLOADERS is not set
# CONFIG_APP_ROLLBACK_ENABLE is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_NONE is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_NONE is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_ERROR is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_WARN is not set
CONFIG_LOG_BOOTLOADER_LEVEL_INFO=y
# CONFIG_LOG_BOOTLOADER_LEVEL_DEBUG is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_VERBOSE is not set
CONFIG_LOG_BOOTLOADER_LEVEL=3
# CONFIG_FLASH_ENCRYPTION_ENABLED is not set
# CONFIG_FLASHMODE_QIO is not set
# CONFIG_FLASHMODE_QOUT is not set
CONFIG_FLASHMODE_DIO=y
# CONFIG_FLASHMODE_DOUT is not set
CONFIG_MONITOR_BAUD=115200
CONFIG_OPTIMIZATION_LEVEL_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_LEVEL_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
# CONFIG_OPTIMIZATION_LEVEL_RELEASE is not set
# CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE is not set
CONFIG_OPTIMIZATION_ASSERTIONS_ENABLED=y
# CONFIG_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_OPTIMIZATION_ASSERTIONS_DISABLED is not set
CONFIG_OPTIMIZATION_ASSERTION_LEVEL=2
# CONFIG_CXX_EXCEPTIONS is not set
CONFIG_STACK_CHECK_NONE=y
# CONFIG_STACK_CHECK_NORM is not set
# CONFIG_STACK_CHECK_STRONG is not set
# CONFIG_STACK_CHECK_ALL is not set
# CONFIG_WARN_WRITE_STRINGS is not set
CONFIG_ADC_CAL_EFUSE_TP_ENABLE=y
CONFIG_ADC_CAL_EFUSE_VREF_ENABLE=y
CONFIG_ADC_CAL_LUT_ENABLE=y
CONFIG_ADC_DISABLE_DAC=y
# CONFIG_GPTIMER_ISR_IRAM_SAFE is not set
# CONFIG_MCPWM_ISR_IRAM_SAFE is not set
# CONFIG_EVENT_LOOP_PROFILING is not set
CONFIG_POST_EVENTS_FROM_ISR=y
CONFIG_POST_EVENTS_FROM_IRAM_ISR=y
CONFIG_GDBSTUB_SUPPORT_TASKS=y
CONFIG_GDBSTUB_MAX_TASKS=32
# CONFIG_OTA_ALLOW_HTTP is not set
# CONFIG_TWO_UNIVERSAL_MAC_ADDRESS is not set
CONFIG_FOUR_UNIVERSAL_MAC_ADDRESS=y
CONFIG_NUMBER_OF_UNIVERSAL_MAC_ADDRESS=4
# CONFIG_ESP_SYSTEM_PD_FLASH is not set
CONFIG_ESP32_DEEP_SLEEP_WAKEUP_DELAY=2000
CONFIG_ESP_SLEEP_DEEP_SLEEP_WAKEUP_DELAY=2000
CONFIG_ESP32_RTC_CLK_SRC_INT_RC=y
CONFIG_ESP32_RTC_CLOCK_SOURCE_INTERNAL_RC=y
# CONFIG_ESP32_RTC_CLK_SRC_EXT_CRYS is not set
# CONFIG_ESP32_RTC_CLOCK_SOURCE_EXTERNAL_CRYSTAL is not set
# CONFIG_ESP32_RTC_CLK_SRC_EXT_OSC is not set
# CONFIG_ESP32_RTC_CLOCK_SOURCE_EXTERNAL_OSC is not set
# CONFIG_ESP32_RTC_CLK_SRC_INT_8MD256 is not set
# CONFIG_ESP32_RTC_CLOCK_SOURCE_INTERNAL_8MD256 is not set
CONFIG_ESP32_RTC_CLK_CAL_CYCLES=1024
CONFIG_PERIPH_CTRL_FUNC_IN_IRAM=y
# CONFIG_ESP32_XTAL_FREQ_26 is not set
CONFIG_ESP32_XTAL_FREQ_40=y
# CONFIG_ESP32_XTAL_FREQ_AUTO is not set
CONFIG_ESP32_XTAL_FREQ=40
CONFIG_BROWNOUT_DET=y
CONFIG_ESP32_BROWNOUT_DET=y
CONFIG_BROWNOUT_DET_LVL_SEL_0=y
CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_0=y
# CONFIG_BROWNOUT_DET_LVL_SEL_1 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_1 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_2 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_2 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_3 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_3 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_4 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_4 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_5 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_5 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_6 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_6 is not set
# CONFIG_BROWNOUT_DET_LVL_SEL_7 is not set
# CONFIG_ESP32_BROWNOUT_DET_LVL_SEL_7 is not set
CONFIG_BROWNOUT_DET_LVL=0
CONFIG_ESP32_BROWNOUT_DET_LVL=0
CONFIG_ESP_SYSTEM_BROWNOUT_INTR=y
CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_LF is not set
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_CR is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_CRLF is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_LF is not set
CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y
# CONFIG_NEWLIB_NANO_FORMAT is not set
CONFIG_NEWLIB_TIME_SYSCALL_USE_RTC_HRT=y
CONFIG_ESP32_TIME_SYSCALL_USE_RTC_HRT=y
CONFIG_ESP32_TIME_SYSCALL_USE_RTC_FRC1=y
# CONFIG_NEWLIB_TIME_SYSCALL_USE_RTC is not set
# CONFIG_ESP32_TIME_SYSCALL_USE_RTC is not set
# CONFIG_NEWLIB_TIME_SYSCALL_USE_HRT is not set
# CONFIG_ESP32_TIME_SYSCALL_USE_HRT is not set
# CONFIG_ESP32_TIME_SYSCALL_USE_FRC1 is not set
# CONFIG_NEWLIB_TIME_SYSCALL_USE_NONE is not set
# CONFIG_ESP32_TIME_SYSCALL_USE_NONE is not set
CONFIG_ESP32_PHY_CALIBRATION_AND_DATA_STORAGE=y
# CONFIG_ESP32_PHY_INIT_DATA_IN_PARTITION is not set
CONFIG_ESP32_PHY_MAX_WIFI_TX_POWER=20
CONFIG_ESP32_PHY_MAX_TX_POWER=20
# CONFIG_REDUCE_PHY_TX_POWER is not set
# CONFIG_ESP32_REDUCE_PHY_TX_POWER is not set
# CONFIG_SPIRAM_SUPPORT is not set
# CONFIG_ESP32_SPIRAM_SUPPORT is not set
CONFIG_CONSOLE_UART_DEFAULT=y
# CONFIG_CONSOLE_UART_CUSTOM is not set
# CONFIG_CONSOLE_UART_NONE is not set
# CONFIG_ESP_CONSOLE_UART_NONE is not set
CONFIG_CONSOLE_UART=y
CONFIG_CONSOLE_UART_NUM=0
CONFIG_CONSOLE_UART_BAUDRATE=115200
# CONFIG_ESP32_DEFAULT_CPU_FREQ_80 is not set
CONFIG_ESP32_DEFAULT_CPU_FREQ_160=y
# CONFIG_ESP32_DEFAULT_CPU_FREQ_240 is not set
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=160
CONFIG_TRACEMEM_RESERVE_DRAM=0x0
# CONFIG_ESP32_PANIC_PRINT_HALT is not set
CONFIG_ESP32_PANIC_PRINT_REBOOT=y
# CONFIG_ESP32_PANIC_SILENT_REBOOT is not set
# CONFIG_ESP32_PANIC_GDBSTUB is not set
CONFIG_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=2304
CONFIG_MAIN_TASK_STACK_SIZE=3584
CONFIG_INT_WDT=y
CONFIG_INT_WDT_TIMEOUT_MS=300
CONFIG_INT_WDT_CHECK_CPU1=y
CONFIG_TASK_WDT=y
CONFIG_ESP_TASK_WDT=y
# CONFIG_TASK_WDT_PANIC is not set
CONFIG_TASK_WDT_TIMEOUT_S=5
CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
# CONFIG_ESP32_DEBUG_STUBS_ENABLE is not set
CONFIG_ESP32_DEBUG_OCDAWARE=y
# CONFIG_DISABLE_BASIC_ROM_CONSOLE is not set
CONFIG_IPC_TASK_STACK_SIZE=1024
CONFIG_TIMER_TASK_STACK_SIZE=3584
# CONFIG_ESP32_APPTRACE_ENABLE is not set
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# CONFIG_ESP32_WIFI_STATIC_TX_BUFFER is not set
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
# CONFIG_ESP32_WIFI_CSI_ENABLED is not set
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_TX_BA_WIN=6
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_RX_BA_WIN=6
CONFIG_ESP32_WIFI_NVS_ENABLED=y
CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_0=y
# CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_1 is not set
CONFIG_ESP32_WIFI_SOFTAP_BEACON_MAX_LEN=752
CONFIG_ESP32_WIFI_MGMT_SBUF_NUM=32
CONFIG_ESP32_WIFI_IRAM_OPT=y
CONFIG_ESP32_WIFI_RX_IRAM_OPT=y
CONFIG_ESP32_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP32_WIFI_ENABLE_WPA3_OWE_STA=y
# CONFIG_ESP_WIFI_NAN_ENABLE is not set
CONFIG_WPA_MBEDTLS_CRYPTO=y
CONFIG_WPA_MBEDTLS_TLS_CLIENT=y
# CONFIG_WPA_WAPI_PSK is not set
# CONFIG_WPA_11KV_SUPPORT is not set
# CONFIG_WPA_MBO_SUPPORT is not set
# CONFIG_WPA_DPP_SUPPORT is not set
# CONFIG_WPA_11R_SUPPORT is not set
# CONFIG_WPA_WPS_SOFTAP_REGISTRAR is not set
# CONFIG_WPA_WPS_STRICT is not set
# CONFIG_WPA_DEBUG_PRINT is not set
# CONFIG_ESP32_ENABLE_COREDUMP_TO_FLASH is not set
# CONFIG_ESP32_ENABLE_COREDUMP_TO_UART is not set
CONFIG_ESP32_ENABLE_COREDUMP_TO_NONE=y
CONFIG_TIMER_TASK_PRIORITY=1
CONFIG_TIMER_TASK_STACK_DEPTH=2048
CONFIG_TIMER_QUEUE_LENGTH=10
# CONFIG_ENABLE_STATIC_TASK_CLEAN_UP_HOOK is not set
# CONFIG_HAL_ASSERTION_SILIENT is not set
# CONFIG_L2_TO_L3_COPY is not set
CONFIG_ESP_GRATUITOUS_ARP=y
CONFIG_GARP_TMR_INTERVAL=60
CONFIG_TCPIP_RECVMBOX_SIZE=32
CONFIG_TCP_MAXRTX=12
CONFIG_TCP_SYNMAXRTX=12
CONFIG_TCP_MSS=1440
CONFIG_TCP_MSL=60000
CONFIG_TCP_SND_BUF_DEFAULT=5760
CONFIG_TCP_WND_DEFAULT=5760
CONFIG_TCP_RECVMBOX_SIZE=6
CONFIG_TCP_QUEUE_OOSEQ=y
CONFIG_TCP_OVERSIZE_MSS=y
# CONFIG_TCP_OVERSIZE_QUARTER_MSS is not set
# CONFIG_TCP_OVERSIZE_DISABLE is not set
CONFIG_UDP_RECVMBOX_SIZE=6
CONFIG_TCPIP_TASK_STACK_SIZE=3072
CONFIG_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# CONFIG_TCPIP_TASK_AFFINITY_CPU0 is not set
# CONFIG_TCPIP_TASK_AFFINITY_CPU1 is not set
CONFIG_TCPIP_TASK_AFFINITY=0x7FFFFFFF
# CONFIG_PPP_SUPPORT is not set
CONFIG_ESP32_PTHREAD_TASK_PRIO_DEFAULT=5
CONFIG_ESP32_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
CONFIG_ESP32_PTHREAD_STACK_MIN=768
CONFIG_ESP32_DEFAULT_PTHREAD_CORE_NO_AFFINITY=y
# CONFIG_ESP32_DEFAULT_PTHREAD_CORE_0 is not set
# CONFIG_ESP32_DEFAULT_PTHREAD_CORE_1 is not set
CONFIG_ESP32_PTHREAD_TASK_CORE_DEFAULT=-1
CONFIG_ESP32_PTHREAD_TASK_NAME_DEFAULT="pthread"
CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ABORTS=y
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_FAILS is not set
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ALLOWED is not set
# CONFIG_ESP32_ULP_COPROC_ENABLED is not set
CONFIG_SUPPRESS_SELECT_DEBUG_OUTPUT=y
# CONFIG_SUPPORT_TERMIOS is not set
CONFIG_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# End of deprecated options
